OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
void handleLimitDelete(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  if(limit.hasLimit()) {
    if (limit.clear()) {
      response->setCode(200);
      response->print("{\"msg\":\"done\"}");
      // todo: mqtt_publish_limit();  // update limit props to mqtt
    } else {
      response->setCode(500);
      response->print("{\"msg\":\"failed\"}");
    }
  } else {
    response->setCode(404);
    response->print("{\"msg\":\"no limit\"}");
  }
}

void handleLimit(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  if(HTTP_GET == request->method()) {
    handleLimitGet(request, response);
  } else if(HTTP_POST == request->method()) {
    handleLimitPost(request, response);
  } else if(HTTP_DELETE == request->method()) {
    handleLimitDelete(request, response);
  } else {
    response->setCode(405);
    response->print("{\"msg\":\"Method not allowed\"}");
  }

  request->send(response);
}

//----------------------------------------------------------
//
//            Energy Meter
//
//----------------------------------------------------------
void handleEmeterDelete(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  String body = request->body().toString();
  DynamicJsonDocument doc(512);
  DeserializationError err = deserializeJson(doc, body);
  if (DeserializationError::Code::Ok == err) {
    if (doc.containsKey("hard") && doc.containsKey("import")) {
      bool hardreset = (bool)doc["hard"];
      bool import = (bool)doc["import"];
      if (evse.resetEnergyMeter(hardreset,import)) {
        response->setCode(200);
        response->print("{\"msg\":\"Reset done\"}");
      }
      else {
        response->setCode(500);
        response->print("{\"msg\":\"Reset failed\"}");
      }

    }
    else {
      response->setCode(500);
      response->print("{\"msg\":\"Reset Failed\"}");
    }
  }
  else {
    response->setCode(500);
    response->print("{\"msg\":\"reset Failed\"}");
  }
}

void handleEmeter(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if (false == requestPreProcess(request, response))
  {
    return;
  }

  if (HTTP_DELETE == request->method())
  {
    handleEmeterDelete(request, response);
  }
  else
  {
    response->setCode(405);
    response->print("{\"msg\":\"Method not allowed\"}");
  }

  request->send(response);
}



  //----------------------------------------------------------

  void handleOverrideGet(MongooseHttpServerRequest * request, MongooseHttpServerResponseStream * response)
  {
    if (manual.isActive())
    {
      EvseProperties props;
      manual.getProperties(props);
      props.serialize(response);
    } else {
    response->setCode(404);
    response->print("{\"msg\":\"No manual override\"}");
  }
}

void handleOverridePost(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  String body = request->body().toString();

  EvseProperties props;
  if(props.deserialize(body))
  {
    if(manual.claim(props)) {
      response->setCode(201);
      response->print("{\"msg\":\"Created\"}");
      mqtt_publish_override();  // update override state to mqtt
    } else {
      response->setCode(500);
      response->print("{\"msg\":\"Failed to claim manual overide\"}");
    }
  } else {
    response->setCode(500);
    response->print("{\"msg\":\"Failed to parse JSON\"}");
  }
}

void handleOverrideDelete(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  if(manual.release()) {
    response->setCode(200);
    response->print("{\"msg\":\"Deleted\"}");
    mqtt_publish_override();  // update override state to mqtt
  } else {
    response->setCode(500);
    response->print("{\"msg\":\"Failed to release manual overide\"}");
  }
}

void handleOverridePatch(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  if(manual.toggle())
  {
    response->setCode(200);
    response->print("{\"msg\":\"Updated\"}");
    mqtt_publish_override();  // update override state to mqtt
  } else {
    response->setCode(500);
    response->print("{\"msg\":\"Failed to toggle manual overide\"}");
  }
}

void
handleOverride(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  if(HTTP_GET == request->method()) {
    handleOverrideGet(request, response);
  } else if(HTTP_POST == request->method()) {
    handleOverridePost(request, response);
  } else if(HTTP_DELETE == request->method()) {
    handleOverrideDelete(request, response);
  } else if(HTTP_PATCH == request->method()) {
    handleOverridePatch(request, response);
  } else {
    response->setCode(405);
    response->print("{\"msg\":\"Method not allowed\"}");
  }

  request->send(response);
}

// -------------------------------------------------------------------
// Reset config and reboot
// url: /reset
// -------------------------------------------------------------------
void
handleRst(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  config_reset();
  ESPAL.eraseConfig();

  response->setCode(200);
  response->print("1");
  request->send(response);

  restart_system();
}


// -------------------------------------------------------------------
// Restart (Reboot)
// url: /restart
// -------------------------------------------------------------------
void
handleRestart(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  response->setCode(200);
  response->print("1");
  request->send(response);

  restart_system();
}

// -------------------------------------------------------------------
// Restart OpenEVSE module
// url: /restartevse
// -------------------------------------------------------------------
void
handleRestartEvse(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  response->setCode(200);
  response->print("1");
  request->send(response);

  evse.restartEvse();
}

// -------------------------------------------------------------------
// Emoncms describe end point,
// Allows local device discover using https://github.com/emoncms/find
// url: //emoncms/describe
// -------------------------------------------------------------------
void handleDescribe(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseBasic *response = request->beginResponse();
  response->setCode(200);
  response->setContentType(CONTENT_TYPE_TEXT);
  response->addHeader("Access-Control-Allow-Origin", "*");
  response->setContent("openevse");
  request->send(response);
}

